AcGiVisualStyle.propertyType(AcGiVisualStyleProperties.Property)
Gets data type of the specified visual style property.
prop:
Input enum AcGiVisualStyleProperties::Property.
Returns:
Returns the AcGiVariant::VariantType of the specified visual style property.

AcGiVisualStyle.traitFlag(AcGiVisualStyleProperties.Property,System.UInt32)
Gets a property flag from the visual style, for properties which are bitfield enums.
flagProp:
Input bitfield enum AcGiVisualStyleProperties::Property to get from the visual style.
flagVal:
Input bit flag enum unsigned long property to get from the visual style.
Returns:
Returns true if flag is enabled, false otherwise.
using namespace AcGiVisualStyleProperties;
bool bJitterEnabled = acgiVisualStyle.traitFlag(kEdgeModifier, kJitter);

AcGiVisualStyle.setTraitFlag(AcGiVisualStyleProperties.Property,System.UInt32,System.Boolean)
Sets a property flag into the visual style, for properties which are bitfield enums.
flagProp:
Input bitfield enum AcGiVisualStyleProperties::Property to set into the visual style.
flagVal:
Input bit flag enum unsigned long property to set into the visual style.
bEnable:
Input bool set to true to enable the flag, false to disable.
Returns:
Returns true if successful; otherwise, returns false.
using namespace AcGiVisualStyleProperties;
acgiVisualStyle.setTraitFlag (kEdgeModifier, kJitter, true);

AcGiVisualStyle.operation(AcGiVisualStyleProperties.Property)
Gets the operation associated with a property.
prop:
Name of the property for which to get the associated operation value.
Returns:
The operation associated with the property.  For invalid property
values, the return value is kInvalidOperation.

AcGiVisualStyle.trait(AcGiVisualStyleProperties.Property,AcGiVisualStyleOperations.Operation*)
Gets a property of the visual style.
prop:
Input AcGiVisualStyleProperties::Property to get from the visual style.
pOp:
Output AcGiVisualStyleOperations::Operation to get the operation
currently in effect for this property.  If NULL, nothing is returned.
Returns:
Returns the AcGiVariant value of the property if successful; otherwise,
returns an AcGiVariant of type AcGiVariant::kUndefined.
AcGiVariant displayBrightness =
acgiVisualStyle.trait (AcGiVisualStyleProperties::kDisplayBrightness);

AcGiVisualStyle.setTrait(AcGiVisualStyleProperties.Property,System.Double,System.Double,System.Double,AcGiVisualStyleOperations.Operation)
Sets a color property of the visual style.
prop:
Input AcGiVisualStyleProperties::Property to set into the visual style.  Valid
Property values for this method are:
red:
Input red color value to set into the visual style.  Valid value is from 0.0 to 1.0.
green:
Input green color value to set into the visual style.  Valid value is from 0.0 to 1.0.
blue:
Input blue color value to set into the visual style.  Valid value is from 0.0 to 1.0.
op:
Input AcGiVisualStyleOperations::Operation to use when setting the property into the visual style.
Returns:
Returns true if successful; otherwise, returns false.
// Set edge intersection color to 110% red
acgiVisualStyle.setTrait (AcGiVisualStyleProperties::kEdgeIntersectionColor, 1.1, 1.0, 1.0);

AcGiVisualStyle.setTrait(AcGiVisualStyleProperties.Property,System.Double,AcGiVisualStyleOperations.Operation)
Sets a double property of the visual style.
prop:
Input AcGiVisualStyleProperties::Property to set into the visual style.  Valid
Property values for this method are:
dVal:
Input double property value to set into the visual style.
op:
Input AcGiVisualStyleOperations::Operation to use when setting the property into the visual style.
Returns:
Returns true if successful; otherwise, returns false.
// Set brightness to 1.0
acgiVisualStyle.setTrait (AcGiVisualStyleProperties::kDisplayBrightness, 1.0);

AcGiVisualStyle.setTrait(AcGiVisualStyleProperties.Property,System.Boolean,AcGiVisualStyleOperations.Operation)
Sets a boolean property of the visual style.
prop:
Input AcGiVisualStyleProperties::Property to set into the visual style.  Valid
Property values for this method are:
bVal:
Input boolean property value to set into the visual style.
op:
Input AcGiVisualStyleOperations::Operation to use when setting the property into the visual style.
Returns:
Returns true if successful; otherwise, returns false.
// Set hide precision to false
acgiVisualStyle.setTrait (AcGiVisualStyleProperties::kEdgeHidePrecision, false);

AcGiVisualStyle.setTrait(AcGiVisualStyleProperties.Property,System.Int32,AcGiVisualStyleOperations.Operation)
Sets an integer property of the visual style.
prop:
Input AcGiVisualStyleProperties::Property to set into the visual style.  Valid
Property values for this method are:
nVal:
Input integer property value to set into the visual style.
op:
Input AcGiVisualStyleOperations::Operation to use when setting the property into the visual style.
Returns:
Returns true if successful; otherwise, returns false.
// Set lighting model to kGooch
using namespace AcGiVisualStyleProperties;
acgiVisualStyle.setTrait (kFaceLightingModel, kGooch);
// Set halogap to 20
acgiVisualStyle.setTrait (AcGiVisualStyleProperties::kEdgeHaloGap, 20);

AcGiVisualStyle.setTrait(AcGiVisualStyleProperties.Property,AcGiVisualStyleOperations.Operation)
Sets the operation associated with a property.
prop:
The AcGiVisualStyleProperties::Property to set the operation for.
op:
The AcGiVisualStyleOperations::Operation for the property to use.
Returns:
Returns true if successful; otherwise, returns false.

AcGiVisualStyle.type
Gets the visual style type.
Returns:
Type of visual style.

AcGiVisualStyle.setType(AcGiVisualStyle.Type)
Sets the visual style type, modifying multiple properties as necessary to
change the visual style into the specified type.
type:
Input enum Type to set into the visual style.
Returns:
Returns true if successful; otherwise, returns false.

AcGiVisualStyle.op_Equality(AcGiVisualStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Comparison operator.  Compares the given visual style with this visual style.
visualStyle:
Input AcGiVisualStyle. A constant reference to the visual style
which will be compared to this visual style.
Returns:
Returns boolean value representing whether the given visual style is equivalent
to this visual style.

AcGiVisualStyle.op_Assign(AcGiVisualStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assignment operator.  Copies the given visual style into this visual style.
visualStyle:
Input AcGiVisualStyle. A constant reference to the visual style
which will be copied into this visual style.
Returns:
Returns a reference to the visual style into which the copy was made.

AcGiVisualStyle.Dispose
Destructor.  Performs any necessary cleanup of the visual style.

AcGiVisualStyle.#ctor(AcGiVisualStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor.  Copies the given visual style into this visual style.
visualStyle:
Input AcGiVisualStyle. A constant reference to the visual style
which will be copied into this visual style.

AcGiVisualStyle.#ctor(AcGiVisualStyle.Type)
Constructor.
type:
Input Type. The type of visual style to configure - a built-in type or
custom.

AcGiVisualStyle.#ctor
Default constructor.  Initializes members to default values.

AcGiVisualStyle
This class defines the collection of visual properties that can be
applied to drawables.